## Solutions for Intro to SQL

In [ ]:
import pandas as pd
import sqlite3

# Load the dataset
df = pd.read_csv("https://raw.githubusercontent.com/schuckers/Charlotte_SCORE_Summer25/refs/heads/main/Modules/Intro%20to%20SQL%20with%20Rugby%20by%20Izaan%20Khudadad/results.csv")

# Create an in-memory SQLite database
conn = sqlite3.connect(":memory:")
df.to_sql('matches', conn, index=False, if_exists='replace')

2783

1. Which countries have hosted the most rugby matches?

In [2]:
query = """
SELECT country, COUNT(*) AS num_matches
FROM matches
GROUP BY country
ORDER BY num_matches DESC
LIMIT 10;
"""
pd.read_sql_query(query, conn)

        country  num_matches
0       England          395
1         Wales          361
2        France          349
3       Ireland          344
4      Scotland          343
5     Australia          271
6   New Zealand          249
7  South Africa          209
8     Argentina          126
9         Italy          115

2. What is the average total score (home + away) for matches in the World Cup?

In [5]:
query = """
SELECT AVG(home_score + away_score) AS avg_total_score
FROM matches
WHERE world_cup = 1;
"""
pd.read_sql_query(query, conn)

   avg_total_score
0        43.306122

4. Which home team has the highest average winning margin?

In [3]:
query = """
SELECT home_team, AVG(home_score - away_score) AS avg_margin
FROM matches
GROUP BY home_team
ORDER BY avg_margin DESC
LIMIT 10;
"""
pd.read_sql_query(query, conn)

      home_team  avg_margin
0   New Zealand   15.631179
1  South Africa    9.274038
2       England    5.717949
3     Australia    4.425856
4        France    3.836310
5       Ireland    2.422535
6         Wales    1.989071
7      Scotland   -0.913043
8     Argentina   -7.878571
9         Italy  -17.717949

5. List all matches played on neutral sites (sample of 5)

In [4]:
query = """
SELECT date, home_team, away_team, home_score, away_score, country
FROM matches
WHERE neutral = 1
LIMIT 5;
"""
pd.read_sql_query(query, conn)

         date  home_team away_team  home_score  away_score      country
0  1887-03-12      Wales   Ireland           0           1      England
1  1987-05-23     France  Scotland          20          20  New Zealand
2  1987-05-25    Ireland     Wales           6          13  New Zealand
3  1987-05-28  Argentina     Italy          25          16  New Zealand
4  1987-06-08    England     Wales           3          16    Australia